# I. Acquire Lesson

## 1-3. Completed
## 4. In a jupyter notebook, classification_exercises.ipynb, use a python module (pydata or seaborn datasets) containing datasets as a source from the iris data. Create a pandas dataframe, df_iris, from this data.

In [8]:
import pandas as pd
import numpy as np
import seaborn as sns

In [ ]:
df_iris = sns.load_dataset('iris')

Print the first three rows:

In [ ]:
df_iris.head(3)

Print the shape:

In [ ]:
df_iris.shape

Print the column names and data types of each:

In [ ]:
df_iris.info()

In [ ]:
df_iris.columns.to_list()

### * Next two are the preferred methods!

In [ ]:
df_iris.dtypes

Print the summary statistics:

In [ ]:
df_iris.describe()

## 5. Read the Table1_CustDetails table from your spreadsheet exercises google sheet into a dataframe named df_google_sheets.

In [ ]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1jvEKrZGWuNGA8b7aZT-e28TceYP-nw18mjReCT03RWo/edit#gid=1756832831'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google_sheets = pd.read_csv(csv_export_url)
df_google_sheets.head()

Assign the first 100 rows to a new dataframe:

In [ ]:
df_google_sheets_sample = df_google_sheets.head(100)
df_google_sheets_sample.shape

Print the number of rows of your original dataframe:

In [ ]:
df_google_sheets.shape[0]

Print the first 5 column names:

In [ ]:
df_google_sheets_sample.columns[:5].to_list()

Print the column names that have a data type of object:

In [ ]:
df_google_sheets_sample.select_dtypes(include = 'object').columns.to_list()

Compute the range for each of the numeric variables:

In [ ]:
df_google_sheets_sample.describe().max() - df_google_sheets_sample.describe().min()

In [ ]:
df_google_sheets.describe().T['max'] - df_google_sheets.describe().T['min']

## 6.  Download your spreadsheet exercises google sheet as an excel file (File → Download → Microsoft Excel). Read the Table1_CustDetails worksheet into a dataframe named df_excel.

In [ ]:
df_excel = pd.read_excel('Storytelling Project Data.xlsx', sheet_name='Table1_CustDetails')

Assign the first 100 rows to a new dataframe:

In [ ]:
df_excel_sample = df_excel.head(100)
df_excel_sample

In [ ]:
df_excel.shape[0]

In [ ]:
df_excel_sample.columns[:5]

In [ ]:
df_excel_sample.select_dtypes(include = 'object').columns

In [ ]:
df_excel_sample.describe().max() - df_excel_sample.describe().min()

## 7.  Read the data from this google sheet into a dataframe, df_google.

In [ ]:
sheet_url = 'https://docs.google.com/spreadsheets/d/1Uhtml8KY19LILuZsrDtlsHHDC9wuDGUSe8LTEwvdI5g/edit#gid=341089357'

csv_export_url = sheet_url.replace('/edit#gid=', '/export?format=csv&gid=')

df_google = pd.read_csv(csv_export_url)

Print the first 3 rows:

In [ ]:
df_google.head(3)

Print the number of rows and columns:

In [ ]:
df_google.shape

Print the column names:

In [ ]:
df_google.columns

Print the data type of each column:

In [ ]:
df_google.info()

Print summary stats:

In [ ]:
df_google.describe()

**** Print unique values for each categorical:

In [ ]:
df_google[['Sex','Cabin','Embarked']].value_counts()

In [ ]:
titanicz = acquire.get_titanic_data()
titanicz

# II. Prepare Lesson

In [9]:
import acquire
import prepare

### Iris Dataset

1. Use the function defined in acquire.py to load the iris data.

In [ ]:
df = acquire.get_iris_data()
df.head()

2.  Drop the species_id and measurement_id columns.

In [ ]:
columns_to_drop = ['species_id','measurement_id']
df_iris = df_iris.drop(columns = columns_to_drop)
df_iris.head()

3. Rename the species_name column to just species.

In [ ]:
df_iris = df_iris.rename(columns={'species_name': 'species'})
df_iris = df_iris.drop_duplicates()
df_iris.info()

4. Create dummy variables of the species name and concatenate onto the iris dataframe. (This is for practice, we don't always have to encode the target, but if we used species as a feature, we would need to encode it).

In [ ]:
dummy_df_iris = pd.get_dummies(df_iris[['species']], drop_first = True)
data = pd.concat([df_iris, dummy_df_iris], axis=1)
data.sample(5)

5. Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [ ]:
def prep_iris(df):
    df = df.drop_duplicates()
    columns_to_drop = ['species_id','measurement_id']
    df = df.drop(columns = columns_to_drop)
    df = df.rename(columns={'species_name': 'species'})
    dummy_df = pd.get_dummies(df[['species']], drop_first = True)
    df = pd.concat([df, dummy_df], axis=1)
    return df

In [ ]:
prep_iris(df_iris)

### Titanics Dataset

1. Use the function defined in acquire.py to load the Titanic data.

In [10]:
df_titanic = acquire.get_titanic_data()
df_titanic.sample(5)

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
449,449,1,1,male,52.0,0,0,30.5000,S,First,C,Southampton,1
462,462,0,1,male,47.0,0,0,38.5000,S,First,E,Southampton,1
512,512,1,1,male,36.0,0,0,26.2875,S,First,E,Southampton,1
821,821,1,3,male,27.0,0,0,8.6625,S,Third,NaN,Southampton,1
589,589,0,3,male,NaN,0,0,8.0500,S,Third,NaN,Southampton,1

In [ ]:
df_titanic.info()

2. Drop any unnecessary, unhelpful, or duplicated columns.

In [ ]:
df_titanic.head()

In [11]:
df_titanic = df_titanic.drop_duplicates()
columns_to_drop = ['passenger_id','deck','class','embarked']
df_titanic = df_titanic.drop(columns = columns_to_drop).rename(columns={'sibsp': 'Siblings/Spouses','parch':'Parents/Children'})
df_titanic

,survived,pclass,sex,age,Siblings/Spouses,Parents/Children,fare,embark_town,alone
0,0,3,male,22.0,1,0,7.2500,Southampton,0
1,1,1,female,38.0,1,0,71.2833,Cherbourg,0
2,1,3,female,26.0,0,0,7.9250,Southampton,1
3,1,1,female,35.0,1,0,53.1000,Southampton,0
4,0,3,male,35.0,0,0,8.0500,Southampton,1
...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,Southampton,1
887,1,1,female,19.0,0,0,30.0000,Southampton,1
888,0,3,female,NaN,1,2,23.4500,Southampton,0
889,1,1,male,26.0,0,0,30.0000,Cherbourg,1
890,0,3,male,32.0,0,0,7.7500,Queenstown,1

3. Encode the categorical columns. Create dummy variables of the categorical columns and concatenate them onto the dataframe.

In [12]:
dummy_df_titanic = pd.get_dummies(df_titanic[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
df_titanic = pd.concat([df_titanic, dummy_df_titanic], axis = 1)
df_titanic

,survived,pclass,sex,age,Siblings/Spouses,Parents/Children,fare,embark_town,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,male,22.0,1,0,7.2500,Southampton,0,1,0,1
1,1,1,female,38.0,1,0,71.2833,Cherbourg,0,0,0,0
2,1,3,female,26.0,0,0,7.9250,Southampton,1,0,0,1
3,1,1,female,35.0,1,0,53.1000,Southampton,0,0,0,1
4,0,3,male,35.0,0,0,8.0500,Southampton,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,Southampton,1,1,0,1
887,1,1,female,19.0,0,0,30.0000,Southampton,1,0,0,1
888,0,3,female,NaN,1,2,23.4500,Southampton,0,0,0,1
889,1,1,male,26.0,0,0,30.0000,Cherbourg,1,1,0,0
890,0,3,male,32.0,0,0,7.7500,Queenstown,1,1,1,0

4. Create a function named prep_titanic that accepts the raw titanic data, and returns the data with the transformations above applied.

In [13]:
def prep_titanic(df):
    df = df.drop_duplicates()
    columns_to_drop = ['passenger_id','deck','class','embarked']
    df = df.drop(columns = columns_to_drop).rename(columns={'sibsp': 'Siblings/Spouses','parch':'Parents/Children'})
    dummy_df = pd.get_dummies(df[['sex', 'embark_town']], dummy_na=False, drop_first=[True, True])
    df = pd.concat([df, dummy_df], axis=1)
    return df

In [14]:
prep_titanic(df_titanic)

KeyError: "['passenger_id' 'deck' 'class' 'embarked'] not found in axis"

### Telco Dataset

In [ ]:
df_telco = acquire.get_telco_data()
pd.set_option('display.max_columns', None)
df_telco.head(2)

In [ ]:
df_telco.info()

In [ ]:
def prep_telco(df):
    df = df.drop_duplicates()
    
    df['total_charges'] = df['total_charges'].str.strip()
    df = df[df.total_charges != '']
    
    # Convert to correct datatype
    df['total_charges'] = df.total_charges.astype(float)
    
    df['gender_encoded'] = df.gender.map({'Female': 1, 'Male': 0})
    df['partner_encoded'] = df.partner.map({'Yes': 1, 'No': 0})
    df['dependents_encoded'] = df.dependents.map({'Yes': 1, 'No': 0})
    df['phone_service_encoded'] = df.phone_service.map({'Yes': 1, 'No': 0})
    df['paperless_billing_encoded'] = df.paperless_billing.map({'Yes': 1, 'No': 0})
    df['churn_encoded'] = df.churn.map({'Yes': 1, 'No': 0})
    
    columns_to_drop = ['monthly_charges.1','customer_id', 'total_charges.1','paperless_billing.1','payment_type_id.1','internet_service_type_id','contract_type_id','payment_type_id']
    df = df.drop(columns = columns_to_drop).rename(columns={'sibsp': 'Siblings/Spouses','parch':'Parents/Children'})
    
    dummy_df = pd.get_dummies(df[['multiple_lines', \
                              'online_security', \
                              'online_backup', \
                              'device_protection', \
                              'tech_support', \
                              'streaming_tv', \
                              'streaming_movies', \
                              'contract_type', \
                              'internet_service_type']], dummy_na=False, \
                              drop_first=True)
    df = pd.concat([df, dummy_df], axis=1)
    
    return df

In [ ]:
telco_train, telco_validate, telco_test = prepare.prep_telco(df_telco)
telco_train.head(2)

In [ ]:
telco_validate.head(2)

In [ ]:
telco_test.head(2)

In [ ]:
telco_train.shape, telco_validate.shape, telco_test.shape

# III. Exploratory Analysis

## *See "EDA Work" Jupyter Notebook found in this repo for work!